app/controllers/calendars_controller.rb

  def show

  		@alluserevents = Calendar.where(:day_of_event => params[:dayis], :user_id => current_user)
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."day_of_event" = '2013-08-19' AND "calendars"."user_id" = 1

  def add

  		@timeis = params[:date][:hour] + ':' + params[:date][:minute] + ":00"
  		@calen_params = {'event' => params[:calendar][:event], 'description' => params[:calendar][:description], 'event_time' => @timeis, 'user_id' => current_user[:id], 'day_of_event' => params[:dayis] }
  		@newevent = Calendar.new(@calen_params)


  		#@temp99 = params
  		if @newevent.save
---
INSERT INTO "calendars" ("created_at", "day_of_event", "description", "event", "event_time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
  	calendar = Calendar.find(params[:id])
  	if calendar.destroy
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 1]]