app/controllers/sessions_controller.rb

	def login
		user = User.find_by(email_address: params[:user][:email_address]).try(:authenticate, params[:user][:password])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'esther@email.com' LIMIT 1