app/controllers/users_controller.rb

  def create

  	@user = User.new(user_params)


    if @user.save
---
INSERT INTO "users" ("created_at", "email_address", "first_name", "last_name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @dateis = (params[:monthis].to_date)
  	@user = Calendar.new

     @year = @dateis.year
    @month = @dateis.month



     @minidate = @year.to_s + "-0" + @month.to_s + "%"

    @howmanyevents = Calendar.where("day_of_event LIKE ?", @minidate).where(user_id: current_user)
---
SELECT "calendars".* FROM "calendars" WHERE "calendars"."user_id" = 7 AND (cast(day_of_event as text) LIKE '2013-08%')